# 100 pandas puzzles

Inspired by [100 Numpy exerises](https://github.com/rougier/numpy-100), here are 100* short puzzles for testing your knowledge of [pandas'](http://pandas.pydata.org/) power.

Since pandas is a large library with many different specialist features and functions, these excercises focus mainly on the fundamentals of manipulating data (indexing, grouping, aggregating, cleaning), making use of the core DataFrame and Series objects. 

Many of the excerises here are stright-forward in that the solutions require no more than a few lines of code (in pandas or NumPy... don't go using pure Python or Cython!). Choosing the right methods and following best practices is the underlying goal.

The exercises are loosely divided in sections. Each section has a difficulty rating; these ratings are subjective, of course, but should be a seen as a rough guide as to how inventive the required solution is.

If you're just starting out with pandas and you are looking for some other resources, the official documentation  is very extensive. In particular, some good places get a broader overview of pandas are...

- [10 minutes to pandas](http://pandas.pydata.org/pandas-docs/stable/10min.html)
- [pandas basics](http://pandas.pydata.org/pandas-docs/stable/basics.html)
- [tutorials](http://pandas.pydata.org/pandas-docs/stable/tutorials.html)
- [cookbook and idioms](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#cookbook)

Enjoy the puzzles!

\* *the list of exercises is not yet complete! Pull requests or suggestions for additional exercises, corrections and improvements are welcomed.*

## Importing pandas

### Getting started and checking your pandas setup

Difficulty: *easy* 

**1.** Import pandas under the name `pd`.

In [1]:
import pandas as pd

**2.** Print the version of pandas that has been imported.

In [2]:
pd.__version__

'0.20.3'

**3.** Print out all the version information of the libraries that are required by the pandas library.

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit: None
python: 3.6.3.final.0
python-bits: 64
OS: Windows
OS-release: 7
machine: AMD64
processor: Intel64 Family 6 Model 37 Stepping 2, GenuineIntel
byteorder: little
LC_ALL: None
LANG: None
LOCALE: None.None

pandas: 0.20.3
pytest: 3.2.1
pip: 9.0.1
setuptools: 36.5.0.post20170921
Cython: 0.26.1
numpy: 1.13.3
scipy: 0.19.1
xarray: None
IPython: 6.1.0
sphinx: 1.6.3
patsy: 0.4.1
dateutil: 2.6.1
pytz: 2017.2
blosc: None
bottleneck: 1.2.1
tables: 3.4.2
numexpr: 2.6.2
feather: None
matplotlib: 2.1.0
openpyxl: 2.4.8
xlrd: 1.1.0
xlwt: 1.3.0
xlsxwriter: 1.0.2
lxml: 4.1.0
bs4: 4.6.0
html5lib: 0.999999999
sqlalchemy: 1.1.13
pymysql: None
psycopg2: None
jinja2: 2.9.6
s3fs: None
pandas_gbq: None
pandas_datareader: None

## DataFrame basics

### A few of the fundamental routines for selecting, sorting, adding and aggregating data in DataFrames

Difficulty: *easy*

Note: remember to import numpy using:
```python
import numpy as np
```

Consider the following Python dictionary `data` and Python list `labels`:

``` python
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
```
(This is just some meaningless data I made up with the theme of animals and trips to a vet.)

**4.** Create a DataFrame `df` from this dictionary `data` which has the index `labels`.

In [53]:
import numpy as np
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],\
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],\
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],\
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  2.0    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

**5.** Display a summary of the basic information about this DataFrame and its data.

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
age         8 non-null float64
animal      10 non-null object
priority    10 non-null object
visits      10 non-null int64
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

**6.** Return the first 3 rows of the DataFrame `df`.

In [6]:
df[:3]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2

**7.** Select just the 'animal' and 'age' columns from the DataFrame `df`.

In [7]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

**8.** Select the data in rows `[3, 4, 8]` *and* in columns `['animal', 'age']`.

In [16]:
df.iloc[[3,4,8]][['animal', 'age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

**9.** Select only the rows where the number of visits is greater than 3.

In [18]:
df[df['visits']>3]

Empty DataFrame
Columns: [age, animal, priority, visits]
Index: []

**10.** Select the rows where the age is missing, i.e. is `NaN`.

In [22]:
df[df['age'].isnull()]

   age animal priority  visits
d  NaN    dog      yes       3
h  NaN    cat      yes       1

**11.** Select the rows where the animal is a cat *and* the age is less than 3.

In [25]:
df[(df['animal']=='cat') & (df['age']<3)]

   age animal priority  visits
a  2.5    cat      yes       1
f  2.0    cat       no       3

**12.** Select the rows the age is between 2 and 4 (inclusive).

In [27]:
df[df['age'].between(2,4)]

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
f  2.0    cat       no       3
j  3.0    dog       no       1

**13.** Change the age in row 'f' to 1.5.

In [54]:
df.loc['f','age'] = 1.5
df

   age animal priority  visits
a  2.5    cat      yes       1
b  3.0    cat      yes       3
c  0.5  snake       no       2
d  NaN    dog      yes       3
e  5.0    dog       no       2
f  1.5    cat       no       3
g  4.5  snake       no       1
h  NaN    cat      yes       1
i  7.0    dog       no       2
j  3.0    dog       no       1

**14.** Calculate the sum of all visits (the total number of visits).

In [38]:
df['visits'].sum()

19

**15.** Calculate the mean age for each different animal in `df`.

In [39]:
df.groupby('animal')['age'].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

**16.** Append a new row 'k' to `df` with your choice of values for each column. Then delete that row to return the original DataFrame.

In [44]:
df.loc['k'] = [4.2, 'fish', 'yes',23]
df.drop('k', inplace=True)

**17.** Count the number of each type of animal in `df`.

In [49]:
df['animal'].value_counts()

dog      4
cat      4
snake    2
Name: animal, dtype: int64

**18.** Sort `df` first by the values in the 'age' in *decending* order, then by the value in the 'visit' column in *ascending* order.

In [55]:
df.sort_values(by=['age', 'visits'], ascending=(False, True))

   age animal priority  visits
i  7.0    dog       no       2
e  5.0    dog       no       2
g  4.5  snake       no       1
j  3.0    dog       no       1
b  3.0    cat      yes       3
a  2.5    cat      yes       1
f  1.5    cat       no       3
c  0.5  snake       no       2
h  NaN    cat      yes       1
d  NaN    dog      yes       3

**19.** The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be `True` and 'no' should be `False`.

In [56]:
df.priority = df['priority'].map({'yes': True, 'no':False})
df

   age animal  priority  visits
a  2.5    cat      True       1
b  3.0    cat      True       3
c  0.5  snake     False       2
d  NaN    dog      True       3
e  5.0    dog     False       2
f  1.5    cat     False       3
g  4.5  snake     False       1
h  NaN    cat      True       1
i  7.0    dog     False       2
j  3.0    dog     False       1

**20.** In the 'animal' column, change the 'snake' entries to 'python'.

In [57]:
df['animal'].replace('snake', 'python', inplace=True)
df

   age  animal  priority  visits
a  2.5     cat      True       1
b  3.0     cat      True       3
c  0.5  python     False       2
d  NaN     dog      True       3
e  5.0     dog     False       2
f  1.5     cat     False       3
g  4.5  python     False       1
h  NaN     cat      True       1
i  7.0     dog     False       2
j  3.0     dog     False       1

**21.** For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

In [67]:
#pd.DataFrame(df.groupby(['animal', 'visits'])['age'].mean())
df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

## DataFrames: beyond the basics

### Slightly trickier: you may need to combine two or more methods to get the right answer

Difficulty: *medium*

The previous section was tour through some basic but essential DataFrame operations. Below are some ways that you might need to cut your data, but for which there is no single "out of the box" method.

**22.** You have a DataFrame `df` with a column 'A' of integers. For example:
```python
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

How do you filter out rows which contain the same integer as the row immediately above?

In [73]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df[df['A'] != df['A'].shift()]

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

**23.** Given a DataFrame of numeric values, say
```python
df = pd.DataFrame(np.random.random(size=(5, 3))) # a 5x3 frame of float values
```

how do you subtract the row mean from each element in the row?

In [77]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df.sub(df.mean(axis = 1), axis = 0)

          0         1         2
0  0.212475 -0.426276  0.213801
1 -0.129338  0.055391  0.073947
2  0.234905 -0.354439  0.119533
3 -0.523803  0.341532  0.182271
4 -0.235047  0.059602  0.175445

**24.** Suppose you have DataFrame with 10 columns of real numbers, for example:

```python
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
```
Which column of numbers has the smallest sum? (Find that column's label.)

In [140]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df.sum().idxmin()

'd'

**25.** How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

In [92]:
len(df.drop_duplicates(keep=False))

5

The next three puzzles are slightly harder...

**26.** You have a DataFrame that consists of 10 columns of floating--point numbers. Suppose that exactly 5 entries in each row are NaN values. For each row of the DataFrame, find the *column* which contains the *third* NaN value.

(You should return a Series of column labels.)

In [136]:
a = np.arange(10).reshape(1,10)
a = np.repeat(a,5,axis = 0)
for i in range(len(a)):
    np.random.shuffle(a[i])
a = a[:,:5]

In [154]:
for i in range (len(a)):
    df.iloc[i][a[i]] = np.NaN
df

,a,b,c,d,e,f,g,h,i,j
0,0.769841,NaN,NaN,0.190103,NaN,0.792896,NaN,0.556865,NaN,0.829801
1,NaN,NaN,NaN,0.616009,0.241869,NaN,NaN,0.246434,0.986274,0.003576
2,0.476185,NaN,NaN,NaN,0.412071,0.462895,0.714046,0.496754,NaN,NaN
3,NaN,NaN,0.476725,NaN,0.167380,0.008060,0.513555,NaN,0.173671,NaN
4,NaN,0.363641,NaN,0.579621,0.499879,NaN,0.131632,0.557671,NaN,NaN

In [160]:
(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)

0    e
1    c
2    d
3    d
4    f
dtype: object

**27.** A DataFrame has a column of groups 'grps' and and column of numbers 'vals'. For example: 

```python
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
```
For each *group*, find the sum of the three greatest values.

In [164]:
df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})
df.groupby('grps')['vals'].nlargest(3).sum()

910

**28.** A DataFrame has two integer columns 'A' and 'B'. The values in 'A' are between 1 and 100 (inclusive). For each group of 10 consecutive integers in 'A' (i.e. `(0, 10]`, `(10, 20]`, ...), calculate the sum of the corresponding values in column 'B'.

In [174]:
A = np.arange(1, 101)
np.random.shuffle(A)
df = pd.DataFrame({'A':A, 'B':np.random.randint(1, 10, size = 100)})
df

     A  B
0   44  1
1   57  7
2   46  9
3   32  8
4   78  9
5   62  4
6   80  4
7   15  4
8   47  3
9   58  5
10  13  7
11  76  3
12   7  9
13  93  5
14  90  2
15  25  9
16   5  5
17  18  9
18  71  4
19  35  3
20  87  5
21  55  6
22  20  4
23   1  3
24  23  8
25  45  7
26  26  2
27  39  6
28  10  3
29  38  7
..  .. ..
70  48  1
71   3  8
72  49  3
73  14  8
74  52  3
75  33  5
76  96  9
77  50  4
78  86  1
79  89  4
80  77  2
81   4  4
82  67  8
83  69  2
84  11  6
85  88  1
86  97  2
87  54  7
88  16  2
89  81  8
90  72  2
91  83  2
92  43  6
93   9  2
94  70  6
95  34  5
96  73  3
97  65  6
98  21  5
99  75  7

[100 rows x 2 columns]

In [177]:
df.groupby(pd.cut(df['A'], np.arange(0, 101, 10)))['B'].sum()

A
(0, 10]      55
(10, 20]     57
(20, 30]     58
(30, 40]     46
(40, 50]     46
(50, 60]     49
(60, 70]     49
(70, 80]     48
(80, 90]     34
(90, 100]    51
Name: B, dtype: int32

## DataFrames: harder problems 

### These might require a bit of thinking outside the box...

...but all are solvable using just the usual pandas/NumPy methods (and so avoid using explicit `for` loops).

Difficulty: *hard*

**29.** Consider a DataFrame `df` where there is an integer column 'X':
```python
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
```
For each value, count the difference back to the previous zero (or the start of the Series, whichever is closer). These values should therefore be `[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]`. Make this a new column 'Y'.

In [179]:
df = pd.DataFrame({'X': [7, 2, 0, 3, 4, 2, 5, 0, 3, 4]})
df

   X
0  7
1  2
2  0
3  3
4  4
5  2
6  5
7  0
8  3
9  4

In [223]:
izero = np.r_[-1, (df['X'] == 0).nonzero()[0]] # indices of zeros
idx = np.arange(len(df))
df['Y'] = idx - izero[np.searchsorted(izero - 1, idx) - 1]
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

Here's an alternative approach based on a [cookbook recipe](http://pandas.pydata.org/pandas-docs/stable/cookbook.html#grouping):

In [230]:
x = (df['X'] != 0).cumsum()
y = x != x.shift()
df['Y'] = y.groupby((y != y.shift()).cumsum()).cumsum()

**30.** Consider a DataFrame containing rows and columns of purely numerical data. Create a list of the row-column index locations of the 3 largest values.

In [241]:
df.unstack().sort_values()[-3:].index.tolist()

[('X', 4), ('X', 6), ('X', 0)]

**31.** Given a DataFrame with a column of group IDs, 'grps', and a column of corresponding integer values, 'vals', replace any negative values in 'vals' with the group mean.

In [265]:
def replace(group):
    #print(group)
    mask = group<0
    group[mask] = group[~mask].mean()
    group.fillna(0,inplace=True)
    return group
 
df = pd.DataFrame({'grps':np.random.randint(1, 5, size = 10), 'vals':np.random.randint(-6,6, size = 10)})
df

   grps  vals
0     3    -3
1     1    -4
2     2    -1
3     3     1
4     1    -4
5     4    -3
6     1     1
7     4    -2
8     1     0
9     4     5

In [266]:
df['new_vals'] = df.groupby(['grps'])['vals'].transform(replace)
df

   grps  vals  new_vals
0     3    -3       1.0
1     1    -4       0.5
2     2    -1       0.0
3     3     1       1.0
4     1    -4       0.5
5     4    -3       5.0
6     1     1       1.0
7     4    -2       5.0
8     1     0       0.0
9     4     5       5.0

**32.** Implement a rolling mean over groups with window size 3, which ignores NaN value. For example consider the following DataFrame:

```python
>>> df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
>>> df
   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0
```
The goal is to compute the Series:

```
0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
```
E.g. the first window of size three for group 'b' has values 3.0, NaN and 3.0 and occurs at row index 5. Instead of being NaN the value in the new column at this row index should be 3.0 (just the two non-NaN values are used to compute the mean (3+3)/2)

In [273]:
df = pd.DataFrame({'group': list('aabbabbbabab'),\
                       'value': [1, 2, 3, np.nan, 2, 3, \
                                 np.nan, 1, 7, 3, np.nan, 8]})
df

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

In [274]:
g1 = df.groupby(['group'])['value']              # group values  
g2 = df.fillna(0).groupby(['group'])['value']    # fillna, then group values

s = g2.rolling(3, min_periods=1).sum() / g1.rolling(3, min_periods=1).count() # compute means
s = s.reset_index(level=0, drop=True).sort_index() 
s

0     1.000000
1     1.500000
2     3.000000
3     3.000000
4     1.666667
5     3.000000
6     3.000000
7     2.000000
8     3.666667
9     2.000000
10    4.500000
11    4.000000
Name: value, dtype: float64

## Series and DatetimeIndex

### Exercises for creating and manipulating Series with datetime data

Difficulty: *easy/medium*

pandas is fantastic for working with dates and times. These puzzles explore some of this functionality.

**33.** Create a DatetimeIndex that contains each business day of 2015 and use it to index a Series of random numbers. Let's call this Series `s`.

In [182]:
dti = pd.date_range(start='2015-01-01', end='2015-12-31', freq='B') 
s = pd.Series(np.random.rand(len(dti)), index=dti)
s

2015-01-01    0.092320
2015-01-02    0.369611
2015-01-05    0.044997
2015-01-06    0.787846
2015-01-07    0.720053
2015-01-08    0.216068
2015-01-09    0.426296
2015-01-12    0.348129
2015-01-13    0.296017
2015-01-14    0.688219
2015-01-15    0.842058
2015-01-16    0.699388
2015-01-19    0.325489
2015-01-20    0.572016
2015-01-21    0.356765
2015-01-22    0.727716
2015-01-23    0.295999
2015-01-26    0.636996
2015-01-27    0.478082
2015-01-28    0.134865
2015-01-29    0.172187
2015-01-30    0.651896
2015-02-02    0.299157
2015-02-03    0.408104
2015-02-04    0.375412
2015-02-05    0.372028
2015-02-06    0.322677
2015-02-09    0.350710
2015-02-10    0.740165
2015-02-11    0.080393
                ...
2015-11-20    0.283810
2015-11-23    0.646304
2015-11-24    0.028148
2015-11-25    0.309395
2015-11-26    0.477023
2015-11-27    0.706643
2015-11-30    0.817850
2015-12-01    0.664829
2015-12-02    0.587582
2015-12-03    0.169796
2015-12-04    0.731122
2015-12-07    0.799970
2015-12-08    0.821656
2015-12-09    0.845220
2015-12-10    0.307058
2015-12-11    0.164506
2015-12-14    0.759663
2015-12-15    0.183422
2015-12-16    0.268016
2015-12-17    0.113388
2015-12-18    0.181464
2015-12-21    0.732037
2015-12-22    0.231477
2015-12-23    0.081317
2015-12-24    0.809971
2015-12-25    0.649112
2015-12-28    0.557918
2015-12-29    0.765060
2015-12-30    0.351075
2015-12-31    0.163653
Freq: B, Length: 261, dtype: float64

**34.** Find the sum of the values in `s` for every Wednesday.

In [186]:
s[s.index.weekday == 2].sum()

22.899555066560897

**35.** For each calendar month in `s`, find the mean of values.

In [188]:
s.resample('M').mean()

2015-01-31    0.449228
2015-02-28    0.458000
2015-03-31    0.526784
2015-04-30    0.426321
2015-05-31    0.521254
2015-06-30    0.493591
2015-07-31    0.461847
2015-08-31    0.541885
2015-09-30    0.557976
2015-10-31    0.471911
2015-11-30    0.380256
2015-12-31    0.475622
Freq: M, dtype: float64

**36.** For each group of four consecutive calendar months in `s`, find the date on which the highest value occurred.

In [189]:
s.groupby(pd.TimeGrouper('4M')).idxmax()

2015-01-31   2015-01-15
2015-05-31   2015-03-10
2015-09-30   2015-07-13
2016-01-31   2015-11-09
Freq: 4M, dtype: datetime64[ns]

**37.** Create a DateTimeIndex consisting of the third Thursday in each month for the years 2015 and 2016.

In [190]:
pd.date_range('2015-01-01', '2016-12-31', freq='WOM-3THU')

DatetimeIndex(['2015-01-15', '2015-02-19', '2015-03-19', '2015-04-16',
               '2015-05-21', '2015-06-18', '2015-07-16', '2015-08-20',
               '2015-09-17', '2015-10-15', '2015-11-19', '2015-12-17',
               '2016-01-21', '2016-02-18', '2016-03-17', '2016-04-21',
               '2016-05-19', '2016-06-16', '2016-07-21', '2016-08-18',
               '2016-09-15', '2016-10-20', '2016-11-17', '2016-12-15'],
              dtype='datetime64[ns]', freq='WOM-3THU')

## Cleaning Data

### Making a DataFrame easier to work with

Difficulty: *easy/medium*

It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis?

Take this monstrosity as the DataFrame to use in the following puzzles:

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```
(It's some flight data I made up; it's not meant to be accurate in any way.)

In [282]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', \
                               'Budapest_PaRis', 'Brussels_londOn'],\
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],\
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],\
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', \
                               '12. Air France', '"Swiss Air"']})
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

**38.** Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column).

In [283]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)         10045      LoNDon_paris      [23, 47]
1    <Air France> (12)         10055      MAdrid_miLAN            []
2  (British Airways. )         10065  londON_StockhOlm  [24, 43, 87]
3       12. Air France         10075    Budapest_PaRis          [13]
4          "Swiss Air"         10085   Brussels_londOn      [67, 32]

**39.** The From\_To column would be better as two separate columns! Split each string on the underscore delimiter `_` to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [284]:
temp = df['From_To'].str.split('_', expand = True)
temp.columns = ['From', 'To']
temp

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

**40.** Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".)

In [285]:
temp['From'] = temp['From'].str.capitalize()
temp['To'] = temp['To'].str.capitalize()
temp

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

**41.** Delete the From_To column from `df` and attach the temporary DataFrame from the previous questions.

In [286]:
del df['From_To']
df = df.join(temp)
df

               Airline  FlightNumber  RecentDelays      From         To
0               KLM(!)         10045      [23, 47]    London      Paris
1    <Air France> (12)         10055            []    Madrid      Milan
2  (British Airways. )         10065  [24, 43, 87]    London  Stockholm
3       12. Air France         10075          [13]  Budapest      Paris
4          "Swiss Air"         10085      [67, 32]  Brussels     London

**42**. In the Airline column, you can see some extra puctuation and symbols have appeared around the airline names. Pull out just the airline name. E.g. `'(British Airways. )'` should become `'British Airways'`.

In [287]:
df['Airline'] = df['Airline'].str.extract('([a-zA-Z\s]+)', expand=False).str.strip()
df

           Airline  FlightNumber  RecentDelays      From         To
0              KLM         10045      [23, 47]    London      Paris
1       Air France         10055            []    Madrid      Milan
2  British Airways         10065  [24, 43, 87]    London  Stockholm
3       Air France         10075          [13]  Budapest      Paris
4        Swiss Air         10085      [67, 32]  Brussels     London

**43**. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.

Expand the Series of lists into a DataFrame named `delays`, rename the columns `delay_1`, `delay_2`, etc. and replace the unwanted RecentDelays column in `df` with `delays`.

In [290]:
delays = df['RecentDelays'].apply(pd.Series)
delays.columns = ['delay_{}'.format(n) for n in range(1, len(delays.columns)+1)]

df = df.drop('RecentDelays', axis=1).join(delays)
df

,Airline,FlightNumber,From,To,delay_1,delay_2,delay_3
0,KLM,10045,London,Paris,23.0,47.0,NaN
1,Air France,10055,Madrid,Milan,NaN,NaN,NaN
2,British Airways,10065,London,Stockholm,24.0,43.0,87.0
3,Air France,10075,Budapest,Paris,13.0,NaN,NaN
4,Swiss Air,10085,Brussels,London,67.0,32.0,NaN

The DataFrame should look much better now.

## Using MultiIndexes

### Go beyond flat DataFrames with additional index levels

Difficulty: *medium*

Previous exercises have seen us analysing data from DataFrames equipped with a single index level. However, pandas also gives you the possibilty of indexing your data using *multiple* levels. This is very much like adding new dimensions to a Series or a DataFrame. For example, a Series is 1D, but by using a MultiIndex with 2 levels we gain of much the same functionality as a 2D DataFrame.

The set of puzzles below explores how you might use multiple index levels to enhance data analysis.

To warm up, we'll look make a Series with two index levels.

**44**. Given the lists `letters = ['A', 'B', 'C']` and `numbers = list(range(10))`, construct a MultiIndex object from the product of the two lists. Use it to index a Series of random numbers. Call this Series `s`.

In [291]:
letters = ['A', 'B', 'C']
numbers = list(range(10))

mi = pd.MultiIndex.from_product([letters, numbers])
s = pd.Series(np.random.rand(30), index=mi)
s

A  0    0.543394
   1    0.195395
   2    0.000517
   3    0.490442
   4    0.401050
   5    0.674902
   6    0.645534
   7    0.750688
   8    0.841237
   9    0.655971
B  0    0.576971
   1    0.577899
   2    0.552314
   3    0.068800
   4    0.471435
   5    0.953624
   6    0.587009
   7    0.668424
   8    0.946937
   9    0.160779
C  0    0.231856
   1    0.953066
   2    0.522297
   3    0.692547
   4    0.406640
   5    0.167090
   6    0.991985
   7    0.355533
   8    0.790735
   9    0.928640
dtype: float64

**45.** Check the index of `s` is lexicographically sorted (this is a necessary proprty for indexing to work correctly with a MultiIndex).

In [292]:
s.index.is_lexsorted()

True

**46**. Select the labels `1`, `3` and `6` from the second level of the MultiIndexed Series.

In [293]:
s.loc[:, [1, 3, 6]]

A  1    0.195395
   3    0.490442
   6    0.645534
B  1    0.577899
   3    0.068800
   6    0.587009
C  1    0.953066
   3    0.692547
   6    0.991985
dtype: float64

**47**. Slice the Series `s`; slice up to label 'B' for the first level and from label 5 onwards for the second level.

In [294]:
s.loc[pd.IndexSlice[:'B', 5:]]

A  5    0.674902
   6    0.645534
   7    0.750688
   8    0.841237
   9    0.655971
B  5    0.953624
   6    0.587009
   7    0.668424
   8    0.946937
   9    0.160779
dtype: float64

**48**. Sum the values in `s` for each label in the first level (you should have Series giving you a total for labels A, B and C).

In [295]:
s.sum(level=0)

A    5.199130
B    5.564192
C    6.040390
dtype: float64

**49**. Suppose that `sum()` (and other methods) did not accept a `level` keyword argument. How else could you perform the equivalent of `s.sum(level=1)`?

In [298]:
s.unstack().sum(axis=0)

0    1.352221
1    1.726360
2    1.075129
3    1.251789
4    1.279125
5    1.795616
6    2.224529
7    1.774644
8    2.578908
9    1.745390
dtype: float64

**50**. Exchange the levels of the MultiIndex so we have an index of the form (letters, numbers). Is this new Series properly lexsorted? If not, sort it.

In [302]:
new_s = s.swaplevel(0, 1)
new_s

0  A    0.543394
1  A    0.195395
2  A    0.000517
3  A    0.490442
4  A    0.401050
5  A    0.674902
6  A    0.645534
7  A    0.750688
8  A    0.841237
9  A    0.655971
0  B    0.576971
1  B    0.577899
2  B    0.552314
3  B    0.068800
4  B    0.471435
5  B    0.953624
6  B    0.587009
7  B    0.668424
8  B    0.946937
9  B    0.160779
0  C    0.231856
1  C    0.953066
2  C    0.522297
3  C    0.692547
4  C    0.406640
5  C    0.167090
6  C    0.991985
7  C    0.355533
8  C    0.790735
9  C    0.928640
dtype: float64

In [303]:
new_s.index.is_lexsorted()

False

In [304]:
new_s = new_s.sort_index()
new_s

0  A    0.543394
   B    0.576971
   C    0.231856
1  A    0.195395
   B    0.577899
   C    0.953066
2  A    0.000517
   B    0.552314
   C    0.522297
3  A    0.490442
   B    0.068800
   C    0.692547
4  A    0.401050
   B    0.471435
   C    0.406640
5  A    0.674902
   B    0.953624
   C    0.167090
6  A    0.645534
   B    0.587009
   C    0.991985
7  A    0.750688
   B    0.668424
   C    0.355533
8  A    0.841237
   B    0.946937
   C    0.790735
9  A    0.655971
   B    0.160779
   C    0.928640
dtype: float64

## Minesweeper

### Generate the numbers for safe squares in a Minesweeper grid

Difficulty: *medium* to *hard*

If you've ever used an older version of Windows, there's a good chance you've played with [Minesweeper](https://en.wikipedia.org/wiki/Minesweeper_(video_game). If you're not familiar with the game, imagine a grid of squares: some of these squares conceal a mine. If you click on a mine, you lose instantly. If you click on a safe square, you reveal a number telling you how many mines are found in the squares that are immediately adjacent. The aim of the game is to uncover all squares in the grid that do not contain a mine.

In this section, we'll make a DataFrame that contains the necessary data for a game of Minesweeper: coordinates of the squares, whether the square contains a mine and the number of mines found on adjacent squares.

**51**. Let's suppose we're playing Minesweeper on a 5 by 4 grid, i.e.
```
X = 5
Y = 4
```
To begin, generate a DataFrame `df` with two columns, `'x'` and `'y'` containing every coordinate for this grid. That is, the DataFrame should start:
```
   x  y
0  0  0
1  0  1
2  0  2
```

In [328]:
X = 5
Y = 4

from itertools import product
df = pd.DataFrame(list(product(np.arange(X), np.arange(Y))), columns=['x', 'y'])

**52**. For this DataFrame `df`, create a new column of zeros (safe) and ones (mine). The probability of a mine occuring at each location should be 0.4.

In [330]:
df['mine'] = np.random.binomial(1, 0.4, X*Y)
df

    x  y  mine
0   0  0     0
1   0  1     0
2   0  2     0
3   0  3     0
4   1  0     0
5   1  1     0
6   1  2     0
7   1  3     1
8   2  0     0
9   2  1     0
10  2  2     0
11  2  3     0
12  3  0     1
13  3  1     0
14  3  2     1
15  3  3     1
16  4  0     1
17  4  1     1
18  4  2     0
19  4  3     1

**53**. Now create a new column for this DataFrame called `'adjacent'`. This column should contain the number of mines found on adjacent squares in the grid. 

(E.g. for the first row, which is the entry for the coordinate `(0, 0)`, count how many mines are found on the coordinates `(0, 1)`, `(1, 0)` and `(1, 1)`.)

In [363]:
df2 = df.set_index(['x','y'])
df2

     mine
x y
0 0     0
  1     0
  2     0
  3     0
1 0     0
  1     0
  2     0
  3     1
2 0     0
  1     0
  2     0
  3     0
3 0     1
  1     0
  2     1
  3     1
4 0     1
  1     1
  2     0
  3     1

In [433]:
df2['adjacent'] = 0
for x, y in df2.index:
    left = (x-1,y)
    right = (x+1,y)
    top = (x, y+1)
    bottom = (x, y-1)
    df2.loc[(x,y),'adjacent'] = 0
    if left in df2.index:
        df2.loc[(x,y),'adjacent'] += df2.loc[left]['mine']
    if right in df2.index:
        df2.loc[(x,y),'adjacent'] += df2.loc[right]['mine']
    if top in df2.index:
        df2.loc[(x,y),'adjacent'] += df2.loc[top]['mine']
    if bottom in df2.index:
        df2.loc[(x,y),'adjacent'] += df2.loc[bottom]['mine']

**54**. For rows of the DataFrame that contain a mine, set the value in the `'adjacent'` column to NaN.

In [441]:
df2.loc[df2['mine'] == 1, 'adjacent'] = np.nan
df2

     mine  adjacent
x y
0 0     0       0.0
  1     0       0.0
  2     0       0.0
  3     0       1.0
1 0     0       0.0
  1     0       0.0
  2     0       1.0
  3     1       NaN
2 0     0       1.0
  1     0       0.0
  2     0       1.0
  3     0       2.0
3 0     1       NaN
  1     0       3.0
  2     1       NaN
  3     1       NaN
4 0     1       NaN
  1     1       NaN
  2     0       3.0
  3     1       NaN

**55**. Finally, convert the DataFrame to grid of the adjacent mine counts: columns are the `x` coordinate, rows are the `y` coordinate.

In [450]:
df2.drop('mine',axis=1).swaplevel().unstack()

  adjacent
x        0    1    2    3    4
y
0      0.0  0.0  1.0  NaN  NaN
1      0.0  0.0  0.0  3.0  NaN
2      0.0  1.0  1.0  NaN  3.0
3      1.0  NaN  2.0  NaN  NaN

In [451]:
df2.drop('mine',axis=1)

     adjacent
x y
0 0       0.0
  1       0.0
  2       0.0
  3       1.0
1 0       0.0
  1       0.0
  2       1.0
  3       NaN
2 0       1.0
  1       0.0
  2       1.0
  3       2.0
3 0       NaN
  1       3.0
  2       NaN
  3       NaN
4 0       NaN
  1       NaN
  2       3.0
  3       NaN

## Plotting

### Visualize trends and patterns in data

Difficulty: *medium*

To really get a good understanding of the data contained in your DataFrame, it is often essential to create plots: if you're lucky, trends and anomalies will jump right out at you. This functionality is baked into pandas and the puzzles below explore some of what's possible with the library.

**56.** Pandas is highly integrated with the plotting library matplotlib, and makes plotting DataFrames very user-friendly! Plotting in a notebook environment usually makes use of the following boilerplate:

```python
import matplotlib.pyplot as plt
%matplotlib inline
plt.style.use('ggplot')
```

matplotlib is the plotting library which pandas' plotting functionality is built upon, and it is usually aliased to ```plt```.

```%matplotlib inline``` tells the notebook to show plots inline, instead of creating them in a separate window.  

```plt.style.use('ggplot')``` is a style theme that most people find agreeable, based upon the styling of R's ggplot package.

For starters, make a scatter plot of this random data, but use black X's instead of the default markers. 

```df = pd.DataFrame({"xs":[1,5,2,8,1], "ys":[4,2,1,9,6]})```

Consult the [documentation](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.plot.html) if you get stuck!

**57.** Columns in your DataFrame can also be used to modify colors and sizes.  Bill has been keeping track of his performance at work over time, as well as how good he was feeling that day, and whether he had a cup of coffee in the morning.  Make a plot which incorporates all four features of this DataFrame.

(Hint:  If you're having trouble seeing the plot, try multiplying the Series which you choose to represent size by 10 or more)

*The chart doesn't have to be pretty: this isn't a course in data viz!*

```
df = pd.DataFrame({"productivity":[5,2,3,1,4,5,6,7,8,3,4,8,9],
                   "hours_in"    :[1,9,6,5,3,9,2,9,1,7,4,2,2],
                   "happiness"   :[2,1,3,2,3,1,2,3,1,2,2,1,3],
                   "caffienated" :[0,0,1,1,0,0,0,0,1,1,0,1,0]})
```

**58.**  What if we want to plot multiple things?  Pandas allows you to pass in a matplotlib *Axis* object for plots, and plots will also return an Axis object.

Make a bar plot of monthly revenue with a line plot of monthly advertising spending (numbers in millions)

```
df = pd.DataFrame({"revenue":[57,68,63,71,72,90,80,62,59,51,47,52],
                   "advertising":[2.1,1.9,2.7,3.0,3.6,3.2,2.7,2.4,1.8,1.6,1.3,1.9],
                   "month":range(12)
                  })
```

Now we're finally ready to create a candlestick chart, which is a very common tool used to analyze stock price data.  A candlestick chart shows the opening, closing, highest, and lowest price for a stock during a time window.  The color of the "candle" (the thick part of the bar) is green if the stock closed above its opening price, or red if below.

![Candlestick Example](img/candle.jpg)

This was initially designed to be a pandas plotting challenge, but it just so happens that this type of plot is just not feasible using pandas' methods.  If you are unfamiliar with matplotlib, we have provided a function that will plot the chart for you so long as you can use pandas to get the data into the correct format.

Your first step should be to get the data in the correct format using pandas' time-series grouping function.  We would like each candle to represent an hour's worth of data.  You can write your own aggregation function which returns the open/high/low/close, but pandas has a built-in which also does this.

The below cell contains helper functions.  Call ```day_stock_data()``` to generate a DataFrame containing the prices a hypothetical stock sold for, and the time the sale occurred.  Call ```plot_candlestick(df)``` on your properly aggregated and formatted stock data to print the candlestick chart.

In [1]:
import numpy as np
def float_to_time(x):
    return str(int(x)) + ":" + str(int(x%1 * 60)).zfill(2) + ":" + str(int(x*60 % 1 * 60)).zfill(2)

def day_stock_data():
    #NYSE is open from 9:30 to 4:00
    time = 9.5
    price = 100
    results = [(float_to_time(time), price)]
    while time < 16:
        elapsed = np.random.exponential(.001)
        time += elapsed
        if time > 16:
            break
        price_diff = np.random.uniform(.999, 1.001)
        price *= price_diff
        results.append((float_to_time(time), price))
    
    
    df = pd.DataFrame(results, columns = ['time','price'])
    df.time = pd.to_datetime(df.time)
    return df

#Don't read me unless you get stuck!
def plot_candlestick(agg):
    """
    agg is a DataFrame which has a DatetimeIndex and five columns: ["open","high","low","close","color"]
    """
    fig, ax = plt.subplots()
    for time in agg.index:
        ax.plot([time.hour] * 2, agg.loc[time, ["high","low"]].values, color = "black")
        ax.plot([time.hour] * 2, agg.loc[time, ["open","close"]].values, color = agg.loc[time, "color"], linewidth = 10)

    ax.set_xlim((8,16))
    ax.set_ylabel("Price")
    ax.set_xlabel("Hour")
    ax.set_title("OHLC of Stock Value During Trading Day")
    plt.show()

**59.** Generate a day's worth of random stock data, and aggregate / reformat it so that it has hourly summaries of the opening, highest, lowest, and closing prices

**60.** Now that you have your properly-formatted data, try to plot it yourself as a candlestick chart.  Use the ```plot_candlestick(df)``` function above, or matplotlib's [```plot``` documentation](https://matplotlib.org/api/_as_gen/matplotlib.axes.Axes.plot.html) if you get stuck.

*More exercises to follow soon...*